{
  "notifications": [
    {
      "id": "2025-09-16-07",
      "date": "2025-09-16",
      "category": "feature",
      "content": {
        "ja": "ボールデザイン選択機能を追加しました。設定画面からデフォルト・Aramithトーナメント・Aramithブラックの3種類のボールデザインを選択できるようになりました。",
        "en": "Added ball design selection feature. You can now choose from 3 ball designs (Default, Aramith Tournament, Aramith Black) in the Settings screen."
      }
    },
    {
      "id": "2025-09-16-06",
      "date": "2025-09-16",
      "category": "improvement",
      "content": {
        "ja": "セットマッチのプレイヤーパネルデザインを改善しました。プレイヤー名と目標セット数の表示を最適化し、スコア数字を大きくして視認性を向上させました。フォントレンダリングも改善しています。",
        "en": "Improved SetMatch player panel design. Optimized player name and target sets display, enlarged score numbers for better visibility, and enhanced font rendering."
      }
    },
    {
      "id": "2025-09-16-05",
      "date": "2025-09-16",
      "category": "improvement",
      "content": {
        "ja": "結果画面システムの大幅な最適化を完了しました。内部コード構造を改善し、メンテナンス性と動作安定性を向上させました（コード量83%削減）。",
        "en": "Completed major optimization of victory screen system. Improved internal code structure for better maintainability and stability (83% code reduction)."
      }
    },
    {
      "id": "2025-09-16-04",
      "date": "2025-09-16",
      "category": "feature",
      "content": {
        "ja": "QRコード共有機能を追加しました。ハンバーガーメニューの「QRコード共有」から、現在のページのQRコードを生成してURLのコピーやX（旧Twitter）・Facebook・LINEでの共有が可能です。",
        "en": "Added QR code sharing feature. Access 'QR Code Share' from hamburger menu to generate QR code for current page with URL copy and sharing via X (formerly Twitter), Facebook, and LINE."
      }
    },
    {
      "id": "2025-09-16-03",
      "date": "2025-09-16",
      "category": "feature",
      "content": {
        "ja": "ジャパンルールの入力画面にスコア推移グラフを追加しました。累計表の下にラック別の得点推移を視覚的に確認できるグラフが表示されます。",
        "en": "Added score progression graph to Japan Rule input screen. A visual graph showing rack-by-rack score progression is now displayed below the cumulative score table."
      }
    },
    {
      "id": "2025-09-16-02",
      "date": "2025-09-16",
      "category": "improvement",
      "content": {
        "ja": "ジャパンルール（5-9, 5-10）を正式版としてリリースしました。ベータ表記を削除し、安定した機能として提供開始します。",
        "en": "Japan Rule (5-9, 5-10) is now officially released. Removed BETA designation and launched as a stable feature."
      }
    },
    {
      "id": "2025-09-16-01",
      "date": "2025-09-16",
      "category": "feature",
      "content": {
        "ja": "ジャパンルールの累計表にページネーション機能を追加しました。入力画面では期間別表示、結果画面では全期間表示がデフォルトとなり、表の左下で「ページ切替」と「一覧表示」を切り替えできます。",
        "en": "Added pagination functionality to Japan Rule cumulative score table. Input screen defaults to period-by-period view, results screen defaults to full view, with toggle links at bottom-left for 'Page Navigation' and 'List View'."
      }
    },
    {
      "id": "2025-09-13-03",
      "date": "2025-09-13",
      "category": "bugfix",
      "content": {
        "ja": "ジャパンルールで「ゲーム終了」ボタンを押した際にポイントがスコア表に反映されない問題と、ゲーム結果画面から戻った際のポイント二重計算問題を修正しました。",
        "en": "Fixed issues where game end button didn't save current rack points to score table and double calculation problem when returning from victory screen in Japan Rule."
      }
    },
    {
      "id": "2025-09-13-02",
      "date": "2025-09-13",
      "category": "improvement",
      "content": {
        "ja": "ジャパンルール（5-9, 5-10）の画面表示を改善し、プレイヤーパネルをコンパクト化、スコア表の文字サイズを最適化して視認性を向上させました。",
        "en": "Improved Japan Rule (5-9, 5-10) screen display with compact player panels and optimized score table font sizes for better visibility."
      }
    },
    {
      "id": "2025-09-13-01",
      "date": "2025-09-13",
      "category": "improvement",
      "content": {
        "ja": "アプリの内部システムを大幅改善し、動作の安定性とパフォーマンスを向上させました。",
        "en": "Significantly improved internal systems for better stability and performance."
      }
    },
    {
      "id": "2025-09-01-01",
      "date": "2025-09-01",
      "category": "feature",
      "content": {
        "ja": "ジャパンルール（5-9, 5-10）ベータ版をリリースしました。",
        "en": "Released Japan Rule (5-9, 5-10) BETA."
      }
    },
    {
      "id": "2025-08-31-05",
      "date": "2025-08-31",
      "category": "bugfix",
      "content": {
        "ja": "ハンバーガーメニューの不要な罫線を削除しました",
        "en": "Removed unnecessary divider from hamburger menu"
      }
    },
    {
      "id": "2025-08-31-01",
      "date": "2025-08-31",
      "category": "feature",
      "content": {
        "ja": "お知らせメニューを追加しました",
        "en": "Added notifications menu"
      }
    },
    {
      "id": "2025-08-31-02", 
      "date": "2025-08-31",
      "category": "bugfix",
      "content": {
        "ja": "チェスクロック設定がリマッチ時に失われる問題を修正しました",
        "en": "Fixed chess clock settings being lost during rematch"
      }
    },
    {
      "id": "2025-08-31-03",
      "date": "2025-08-31", 
      "category": "bugfix",
      "content": {
        "ja": "メニュー操作時の確認ダイアログを追加し、メッセージを動的に変更するよう修正しました",
        "en": "Added confirmation dialog for menu navigation and implemented dynamic messages"
      }
    },
    {
      "id": "2025-08-31-04",
      "date": "2025-08-31",
      "category": "feature", 
      "content": {
        "ja": "結果画面にホームボタンを追加しました",
        "en": "Added home button to victory screen"
      }
    }
  ]
}